// 维护异或的数据结构，判断一堆数字能不能异或出什么东西

// 构建线性基
void insert(int num)
{
    for (int i = 50; i >= 0; i--)
    {
        if ((num >> i) & 1)
        {
            if (!p[i])
            {
                p[i] = num;
                cnt++;
                break;
            }
            num ^= p[i];
        }
    }
}

// 求这堆数字能构建出的最大值
    for (int i = 50; i >= 0; i--)
        if (p[i])
            ans = max(ans, ans ^ p[i]);

// 最小值就是 for(int i = 0; i <= 50; i++) 遇到的第一个 p[i] != 0 的，要注意判断是否有 0 的存在，如果有就要特判 0 可以构建出来

// 这堆数字一共能异或出 2^{cnt} 个不同的数字

// 要合并两个线性基，就是把一个插进另一个里面
